Revit 2027 API
IDockablePaneProvider.SetupDockablePane Method
 Method called during initialization of the user interface to gather information about a dockable pane window.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void SetupDockablePane(
	DockablePaneProviderData data
)
Sub SetupDockablePane (
	data As DockablePaneProviderData
)
void SetupDockablePane(
	DockablePaneProviderData^ data
)
abstract SetupDockablePane :
        data : DockablePaneProviderData -> unit
Parameters
data DockablePaneProviderData
 Container for information about the new dockable pane. Implementers should set the FrameworkElement and InitialState Properties. Optionally, providers can set the ContextualHelp property if they wish to provide or react to help requests on the pane, or override the default EditorInteraction property by setting it here.
See Also
Reference
IDockablePaneProvider Interface
Autodesk.Revit.UI Namespace